/**
 * Sound (SDAT) API.
 *
 * TODO: Document what can and can't be done using the reversed API in its
 * current state.
 *
 * Some notes on how the API for the Sound Archive (SDAT) works.
 *
 * 1) A 'sound source' is either a sound sequence or a sound stream. The
 *    maximum number of sound sources that can be played simultaneously is 16
 *    for sequences (SEQ) and 4 for streams (STRM). Sound streams can't be
 *    played since code for it seems to be missing from the ROM.
 *
 * 2) All music and sound effects are in a special format called a Sound
 *    sequence (SEQ), think Midi.
 *
 * 3) Sound sequences (SEQ) are added to a list of audio sources for playback
 *    using the 'ndk_sound_add_source_seq' and 'ndk_sound_add_source_seqarc'
 *    functions.
 *
 * 4) Added audio sources will only start playing after 'ndk_sound_process' has
 *    been called.
 *
 * 5) As soon as a sound sequence has finished it's removed from the list of
 *    sound sources.
 *
 * 6) All sound sequences have a player assigned to them. If a sound sequence
 *    is playing and another sound source is added that uses the same player
 *    it will replace the old one.
 *
 * 7) All sequence and stream playback is done by the ARM7. Note for streams
 *    it looks like there is some decoding from IMA-ADPCM to PCM16 that is done
 *    on the ARM9 side for some reason. Making IMA-ADPCM streams somewhat less
 *    attractive to use.
 *
 * See: http://www.feshrine.net/hacking/doc/nds-sdat.php
 * See: https://gota7.github.io/NitroStudio2/specs/soundData.html
 * See: http://www.feshrine.net/hacking/doc/nds-sdat.php
 * See: https://github.com/Kermalis/VGMusicStudio
 * See: https://ndspy.readthedocs.io/en/latest/index.html
 *
 *
 * Code example on how open an SDAT archive for playback:
 *
 * // initialize the sound lib
 * ndk_sound_init();
 *
 * // initialize a heap that the sound lib will use. buffer is a reference to
 * // memory that is large enough to hold all sound data needed by the program
 * // or game at one time.
 * struct sound_heap *snd_heap = ndk_sound_sdat_heap_init(buffer, size);
 *
 * struct sound_arch *arch;
 * ndk_sound_open_sdat_archive(arch, "/my_sound_arch.sdat", snd_heap, false);
 *
 * // initialize players using player data defined in the SDAT archive.
 * ndk_sound_sdat_init_seq_players(snd_heap);
 *
 * // sound data can now be loaded from the archive.
 *
 * TODO: give an code example on how to play a sound data.
 */
#ifndef SOUND_INCLUDE_FILE
#define SOUND_INCLUDE_FILE

#include <stdbool.h>

#include "file.h"
#include "thread.h"

/*
 * Sound IO error code defines
 */

#define SOUND_SUCCESS 0
#define SOUND_INVALID_GROUP 1
#define SOUND_INVALID_SEQ 2
#define SOUND_INVALID_SEQARC 3
#define SOUND_INVALID_BANK 4
#define SOUND_INVALID_WAVEARC 5
#define SOUND_LOAD_SEQ_ERROR 6
#define SOUND_LOAD_SEQARC_ERROR 7
#define SOUND_LOAD_BANK_ERROR 8
#define SOUND_LOAD_WAVEARC_ERROR 9

/*
 * The types of file that can be contained in a group.
 */
 #define SOUND_INFO_GROUP_TYPE_SEQ 0
 #define SOUND_INFO_GROUP_TYPE_BANK 1
 #define SOUND_INFO_GROUP_TYPE_WAVEARC 2
 #define SOUND_INFO_GROUP_TYPE_SEQARC 3

/*
 * These flags are OR'd to enable or disable automatic loading of dependent
 * files in group entries.
 *
 * For example sequence files are usually loaded with 7 this will load the seq
 * file and also bank and wavearc files as well.
 *
 * NOTE: For seqarcs dependent files are *never* loaded. Only the seqarc flag is
 * considered. This is probably due to the fact that the sequences in the seqarc
 * can depend on any number of banks and wavearcs in a non-tivial way.
 */
#define SOUND_INFO_GROUP_FLAG_SEQ 1
#define SOUND_INFO_GROUP_FLAG_BANK 2
#define SOUND_INFO_GROUP_FLAG_WAVEARC 4
#define SOUND_INFO_GROUP_FLAG_SEQARC 8

struct sound_seq {
  unsigned short bnk;	// Bank
  unsigned char vol;	// Volume
  unsigned char cpr;  // channel priority
  unsigned char ppr;  // player priority
  unsigned char ply;  // player [0-31]
  unsigned char unknown2[2]; // padding
};

struct sound_info_seq {
  union {
    unsigned int fat_id;	  // for accessing this file
    /*
     * For a seq files in a seqarc. Offset Where the seq is within the seqarc
     * file.
     */
    unsigned int nOffset;
  } head;
  struct sound_seq data;
};

struct sound_info_seqarc {
  unsigned int fat_id;
};

struct sound_info_bank {
  unsigned int fat_id;
  // Associated WAVEARC(s). 0xffff if not in use.
  unsigned short wavearc[4];
};

struct sound_info_wavearc {
  unsigned int fat_id : 24;
  /**
   * Bit 0: Cache archive header data only
   *  1 : Load only archive header data. All SWAV files that you intend to use
   *      for playback needs to be manually loaded into RAM. Note that there
   *      seem to be no function present in the ROM that does this. So to use
   *      this feature you will have to implement it yourself.
   *
   *      Implementation notes: The SWARs 'DATA' chunk contains an array of
   *      offsets to all embedded SWAV files. When caching header only the
   *      'SWAR' and 'DATA' chunks are loaded into RAM. *But* the array of
   *      offsets is doubled in size. The lower half will be zeroed out,
   *      probably to signal that no SWAVs have been loaded yet. The upper half
   *      contains a copy of the original array. This upper half can be used to
   *      accuire the file offset of the SWAV file you want to load. Once
   *      loaded write the RAM address back to the lower part.
   *
   *      Header caching is useful if you have very large wave archives that
   *      don't fit in your sound heap and you know you only will need a
   *      subset of the sound samples at a given time.
   *
   *      See: http://www.feshrine.net/hacking/doc/nds-sdat.php#swar
   *
   *      Note: Checkout the sound heap functions in this module if you feel
   *      the need to add heap management support to you SWAV load function.
   *
   *  0 : Load entire archive (all sound data) into RAM.
   */
  unsigned int flag : 8;
};

struct sound_info_player {
  // max seq that can be played at once by this player.
  unsigned char max_sequences;
  /**
   * Bit array of allowed hardware channels to use. If set to zero channel
   * allocation will be dynamic.
   */
  unsigned short channels;
  /**
   * Max amount of memory the player is allowed to use to load sound data. If
   * set to zero all sound data has to be preloaded manually before starting
   * playback of any sound sequences that use this player. Use
   * ndk_sound_load_group for instance to preload sound data. If not zero sound
   * data will be loaded dynamically when calling any of the
   * ndk_sound_add_source_xxx functions. Note however in this case there might
   * some delay before the sound is played due to having to get the sound data
   * from the ROM first.
   */
  unsigned int heap_size;
};

struct sound_info_group {
  unsigned int nCount;		// number of sub-records
  struct {
    unsigned char type;   // convert to enum?
    unsigned char flags;  // convert to enum?
    unsigned int nEntry;  // index
  } Group[1];
};

struct sound_info_player2 {
  unsigned char nCount;       // number of elements in v
  unsigned char v[16];		    // 0xff if not in use
  unsigned char unk0[7];	    // padding, 0s
};

struct sound_info_strm {
  unsigned int fat_id;		  // for accessing the file
  unsigned char vol;		    // volume
  unsigned char pri;        // priority
  unsigned char ply;        // player [0-7] ?
  unsigned char unk0[5];
};

struct sound_fat_rec {
  unsigned int nOffset;		      // offset of the sound file
  unsigned int nSize;		        // size of the Sound file
  unsigned int rt_ram_address;  // run-time RAM address, always 0 in file.
  unsigned int unk0[1];	        // always 0s, for storing data runtime or pad.
};

struct sound_fat_table {
  char type[4];		              // 'FAT '
  unsigned int nSize;		        // size of the FAT block
  unsigned int nCount;		      // Number of FAT records
  struct sound_fat_rec Rec[1];	// Arrays of FAT records
};

/**
 * Sound library run-time structures
 */

struct sound_list;
struct sound_list_node;

/**
 * Double linked list. Used to support lists of various types for internal
 * book keeping.
 *
 * A list element must include a sound_list_node structure. When a list is
 * initialized the offset to the sound_list_node structure must be supplied so
 * it can be found by the sound list functions.
 */

struct sound_list {
  void *first;                // 0x0
  void *last;                 // 0x4
  unsigned short count;       // 0x8
  unsigned short node_offset; // 0xa
  // 0x0c
};

struct sound_list_node {
    void *prev;               // 0x0
    void *next;               // 0x4
    // 0x8
};

// List struct definition end.

struct sound_sdat_arch;
struct sound_sdat_heap_node;

// Notify function that gets called then sound heap memory is free'd.
typedef void (*sdat_heap_free_fn)(void *mem, int size,
                                  struct sound_sdat_arch *arch, int fat_id);

struct sound_sdat_heap_node {
  struct sound_list_node node;          // 0x00
  int size;                             // 0x08
  sdat_heap_free_fn free_notify;        // 0x0c
  // this value can be NULL
  struct sound_sdat_arch *arch;         // 0x10
  int fat_id;                           // 0x14
  char pad[8];                          // 0x18
  // 0x20
  // memory block starts here
};

/**
 * NOTE: The heap is a LIFO structure that at every entry holds groups of
 * allocated blocks. The top entry in the LIFO structure is considered to be the
 * current heap. All blocks created with a call to ndk_sound_sdat_heap_alloc
 * will be added to the group of the current heap. ndk_sound_sdat_heap_free will
 * pop/destroy all groups of allocated blocks to the requested LIFO level. To
 * create/push a new group use ndk_sound_sdat_heap_new_group
 *
 * NOTE: LIFO level zero (0) is reserved for players and data allocated by
 * the open sdat archive function.
 *
 * NOTE: size unknown
 */
struct sound_sdat_heap {
  void *unk0;                 // 0x00
  /**
   * This list implemets the LIFO structure that holds groups of allocated
   * blocks.
   *
   * sound_list.count is used by by ndk_sound_sdat_heap_new_group
   */
  struct sound_list allocator_stack;  // 0x04
};

// in memory sdat archive structure
struct sound_sdat_arch {
  char type[4];               // 0x00 'SDAT'
  unsigned int magic;	        // 0x04 always 0x0100feff
  unsigned int file_size;     // 0x08 total file size
  unsigned short size;        // 0x0c header size
  unsigned short blocks;      // 0x0e
  unsigned int symbol_offset; // 0x10
	unsigned int symbol_size;   // 0x14
	unsigned int info_offset; 	// 0x18
	unsigned int info_size;    	// 0x1c
	unsigned int fat_offset;   	// 0x20
	unsigned int fat_size;     	// 0x24
	unsigned int file_offset; 	// 0x28
	unsigned int file_block_size; // 0x2c
  int unk1;                   // 0x30
  struct file file_handle;    // 0x34
  struct fat_handle fat_handle;  // 0x7c
  struct sound_fat_table *cached_fat_table;     // 0x84
  void *cached_symbol_block;  // 0x88
  void *cached_info_block;    // 0x8c
  // 0x90
};

struct sound_seq_source;

struct sound_player;

struct sound_handle;

struct sound_stream_source;

struct sound_player2;

struct sound_handle {
  struct sound_seq_source *elem;
};

struct sound_player {
  void *unk0;                  // 0x00
  void *unk1;                  // 0x04
  char unk2[28];               // 0x08
  // 0x24
};

struct sound_player2 {
  char unk0[48];               // 0x00
  // 0x30
};

struct sound_fade_info {
  int curr_volume;             // 0x00
  int volume;                  // 0x04
  int curr_duration;           // 0x08
  int duration;                // 0x0c
  // 0x10
};

struct sound_seq_source {
  struct sound_handle *handle;  // 0x00
  struct sound_player *player;  // 0x04
  int unk1;                     // 0x08
  int unk2;                     // 0x0c
  int unk3;                     // 0x10
  struct sound_list_node list;  // 0x14
  struct sound_fade_info fade;  // 0x1c
  // 0 : not playing
  // 1 : playing
  // 2 : pending to be stopped ?
  unsigned char status;         // 0x2c
  char unk17;                   // 0x2d
  // bool
  char paused;                  // 0x2e
  // bool
  char unk15;                   // 0x2f
  int unk9;                     // 0x30
  // 0: none, 1:seq, 2:seqarc seq
  unsigned short seq_type;      // 0x34
  short unk10;                  // 0x36
  union {
    unsigned short seq_id;      // 0x38
    struct {
      unsigned short arc_id;    // 0x38
      unsigned short seq_id;    // 0x3a
    } seqarc;
  };
  char player_var_id;           // 0x3c
  char unk12[3];                // 0x3d
  unsigned char volume;         // 0x40
  char unk16;                   // 0x41
  short unk13;                  // 0x42
  // 0x44
};

struct sound_stream_source {
  char unk0[0x5c];              // 0x00
  struct file handle;           // 0x5c
  char *file_offset;            // 0xa4
  // read buffer
  char buffer[0x40];            // 0xa8
  struct sound_fade_info fade_info;       // 0xe8
  char unk1[0x18];              // 0xf8
  /**
   * bit array of booleans
   */
  unsigned int flags;           // 0x110
  unsigned int unk2;            // 0x114
  unsigned int unk3;            // 0x118
  unsigned int unk4;            // 0x11c
  unsigned int unk5;            // 0x120
  char unk6[0x3c];              // 0x124
  void *open_file;              // 0x160
  void *close_file;             // 0x164
  void *read_file;              // 0x168
  void *unk1_fn_ptr;            // 0x16c
  // 0x170
};

struct sound_stream_handler_thread {
  struct thread worker_thread;    // 0x00
  char unk0[8];                   // 0xb8 -- pad ?
  char worker_thread_stack[1024]; // 0xc0
  struct thread_list *pending_list; // 0x4c0
  char unk3[16];                  // 0x4c8 -- struct of 4 int
  int unk4;                       // 0x4d8
  int unk5;                       // 0x4dc
  struct sound_list list;         // 0x4e0 -- not confirmed
};

/**
 * This structure contains the local and global player variables. Every player
 * has 16 local variables of 16 bits each. And there are an additional 16
 * global variables of 16 bits each. The global variables are shared by all
 * players.
 *
 * NOTE: All state in this structure is read/written to by the ARM7 which
 * handles all sound playback.
 *
 * NOTE: This is probably IPC data state. Consider moving this definition to
 * ipc.h.
 *
 * NOTE: Size is estimated!!
 */
extern char sound_players_variable_states[640];

/**
 * This is the current SDAT archive the library will use for playback.
 */
extern struct sound_sdat_arch *sound_current_sdat_archive;

extern char sound_temp_data_buffer[60];

extern struct sound_list sound_seq_queue;

extern struct sound_seq_source sound_seq_sources[16];

extern struct sound_player sound_seq_players[32];


extern int sound_stream_initialized;

extern void *sound_stream_buffer;

